cf_billing/Catalogs/энргКомментарииКСудебномуДелу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКомментарииКСудебномуДелу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргБанкротство</v8:Type>
						<v8:Type>cfg:DocumentRef.бестРегистрацияБанкротства</v8:Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОтчёта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебноеЗаседание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗадачаПИДПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.энргРеструктуризацияЗадолженностиПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.энргСоглашениеПоРассрочкеПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргЗадачаПИДПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргЗадачаПИДПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Comment>Расширение файла версии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Comment>Пользователь, занявший файл для редактирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Comment>Служебное поле для обмена файлами в РИБ</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаЭлектронногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПодписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>260</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомуВыданСертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подпись</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановившийПодпись</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверкиПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьВерна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргКомментарииКСудебномуДелу/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Дело, СтатусОтчет, СудебноеЗаседание; 
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла(".tmp");
	ВременныйКаталог = СтрЗаменить(ВременныйКаталог, ".tmp", ""); 
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("Дело", Дело) Тогда 
			Объект.Дело = Дело;
		КонецЕсли;
		Если Параметры.ЗначенияЗаполнения.Свойство("СтатусОтчет", СтатусОтчет) Тогда
			Объект.СтатусОтчет = СтатусОтчет;
		КонецЕсли;
		Если Параметры.ЗначенияЗаполнения.Свойство("СудебноеЗаседание", СудебноеЗаседание) Тогда
			Объект.СудебноеЗаседание = СудебноеЗаседание;
		КонецЕсли;
		Объект.Период = ТекущаяДатаСеанса();
	Иначе
		Элементы.Период.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Объект.СтатусОтчет Тогда
		Заголовок = "Статус-отчет";
		АвтоЗаголовок = Ложь;
		
		ПолучитьФайлыНаСервере();
	ИначеЕсли Объект.СудебноеЗаседание Тогда
		Заголовок = "Судебное заседание";
		Элементы.Период.Заголовок = "Дата изменения статуса";
		АвтоЗаголовок = Ложь;
		
		ПолучитьФайлыНаСервере();
	Иначе
		Элементы.Переместить(Элементы.Комментарий, ЭтаФорма, Элементы.Страницы);
		Элементы.Страницы.Видимость	= Ложь;
	КонецЕсли;
	Элементы.ДатаСледующегоОтчёта.Видимость	= Объект.СтатусОтчет;
	Элементы.СудебнаяИнстанция.Видимость	= Объект.СудебноеЗаседание;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьФайлыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Попытка
		УдалитьФайлы(ВременныйКаталог); 
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.СтатусОтчет И ЗначениеЗаполнено(Объект.ДатаСледующегоОтчёта) И Объект.Период >= Объект.ДатаСледующегоОтчёта Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата следующего отчёта должна быть позже текущего отчёта.");
		Возврат;
	КонецЕсли;
	
	АдресаФайлов  = Новый СписокЗначений;
	СтрокиУдалить = Новый Массив;
	
	Для каждого ТекСтрокаТЧ Из ПрикрепитьФайлы Цикл
		Если Не ТекСтрокаТЧ.ПрикрепленКДелу И ЗначениеЗаполнено(ТекСтрокаТЧ.АдресФайла) Тогда
			Попытка
				Двоичное = Новый ДвоичныеДанные(ТекСтрокаТЧ.АдресФайла);
				Адрес	 = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор);
				АдресаФайлов.Добавить(Адрес, ТекСтрокаТЧ.ИмяФайла);
				СтрокиУдалить.Добавить(ТекСтрокаТЧ);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если АдресаФайлов.Количество() > 0 Тогда
		Для каждого ТекСтрокаТЧ Из СтрокиУдалить Цикл
			ПрикрепитьФайлы.Удалить(ТекСтрокаТЧ);
		КонецЦикла;

		ПараметрыЗаписи.Вставить("АдресаФайлов", АдресаФайлов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Перем АдресаФайлов;
	
	Если ПараметрыЗаписи.Свойство("АдресаФайлов", АдресаФайлов) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("АдресаФайлов", АдресаФайлов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПолучитьФайлыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПолучитьФайлыНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ПрикрепитьФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ДобавитьВыбранныйФайл", ЭтотОбъект, Новый Структура("Диалог", Диалог)));	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыПередУдалением(Элемент, Отказ)
	ТекСтрокаТЗ = Элементы.ПрикрепитьФайлы.ТекущиеДанные;
	Если ТекСтрокаТЗ <> Неопределено И ТекСтрокаТЗ.ПрикрепленКДелу Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя в отчёте удалять и изменять файлы, прикреплённые к делу.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыАдресФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекЭлем = Элементы.ПрикрепитьФайлы.ТекущиеДанные;
	Если ТекЭлем <> Неопределено И ЗначениеЗаполнено(ТекЭлем.АдресФайла)  Тогда
		ЗапуститьПриложение(СокрЛП(ТекЭлем.АдресФайла)); 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ДополнительныеМетоды
&НаСервере
Процедура ПолучитьФайлыНаСервере()
	
	Перем Выборка, Запрос, РезультатЗапроса, СтрокаТЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДПрисоединенныеФайлы.Наименование КАК Наименование,
		|	энргЗадачаПИДПрисоединенныеФайлы.Расширение КАК Расширение,
		|	энргЗадачаПИДПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргКомментарииКСудебномуДелу.Файлы КАК энргКомментарииКСудебномуДелуФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗадачаПИДПрисоединенныеФайлы КАК энргЗадачаПИДПрисоединенныеФайлы
		|		ПО энргКомментарииКСудебномуДелуФайлы.Файл = энргЗадачаПИДПрисоединенныеФайлы.Ссылка
		|ГДЕ
		|	энргКомментарииКСудебномуДелуФайлы.Ссылка = &Ссылка
		|	И НЕ энргЗадачаПИДПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если Объект.СудебноеЗаседание Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.энргЗадачаПИДПрисоединенныеФайлы", "Справочник.энргБанкротствоПрисоединенныеФайлы");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПрикрепитьФайлы.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЗ = ПрикрепитьФайлы.Добавить();
		СтрокаТЗ.ПрикрепленКДелу	  = Истина;
		СтрокаТЗ.ИмяФайла			  = Выборка.Наименование + "." + Выборка.Расширение;
		СтрокаТЗ.Ссылка				  = Выборка.Ссылка;
		СтрокаТЗ.Расширение			  = Выборка.Расширение;
		СтрокаТЗ.АдресВременногоФайла = ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлыНаКлиенте()
	Перем ДвоичФайл, ИмяФайла, СтрокаТЗ;
	
	Для каждого СтрокаТЗ Из ПрикрепитьФайлы Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.АдресВременногоФайла) И ПустаяСтрока(СтрокаТЗ.АдресФайла) Тогда
			ИмяФайла  = ВременныйКаталог + "\" + Строка(Новый УникальныйИдентификатор) + "." + СтрокаТЗ.Расширение;
			
			ДвоичФайл = ПолучитьИзВременногоХранилища(СтрокаТЗ.АдресВременногоФайла);
			Попытка
				ДвоичФайл.Записать(ИмяФайла); 
				СтрокаТЗ.АдресФайла = ИмяФайла;
				СтрокаТЗ.АдресВременногоФайла = "";
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныйФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Модифицированность = Истина;
		Для каждого ПутьКФайлу Из ВыбранныеФайлы Цикл
			СтрокаТЗ = ПрикрепитьФайлы.Добавить();
			СтрокаТЗ.АдресФайла = ПутьКФайлу;
			СтрокаТЗ.ИмяФайла	= СтрЗаменить(Диалог.ПолноеИмяФайла, Диалог.Каталог, "");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 
#КонецОбласти
